vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7028.inc
FEESTA_OFFSET                  EQU       0x0800
FEEMOD_OFFSET                  EQU       0x0804
FEECON_OFFSET                  EQU       0x0808
FEEDAT_OFFSET                  EQU       0x080C
FEEADR_OFFSET                  EQU       0x0810
FEESIGN_OFFSET                 EQU       0x0818
FEEPRO_OFFSET                  EQU       0x081C
FEEHIDE_OFFSET                 EQU       0x0820

; PWM

PWMBASE                        EQU       0xFFFFFC00
PWMCON                         EQU       0xFFFFFC00
PWMSTA                         EQU       0xFFFFFC04
PWMDAT0                        EQU       0xFFFFFC08
PWMDAT1                        EQU       0xFFFFFC0C
PWMCFG                         EQU       0xFFFFFC10
PWMCH0                         EQU       0xFFFFFC14
PWMCH1                         EQU       0xFFFFFC18
PWMCH2                         EQU       0xFFFFFC1C
PWMEN                          EQU       0xFFFFFC20
PWMDAT2                        EQU       0xFFFFFC24
Z_PWMCON                       EQU       PWMCON    -Z_BASE
Z_PWMSTA                       EQU       PWMSTA    -Z_BASE
Z_PWMDAT0                      EQU       PWMDAT0   -Z_BASE
Z_PWMDAT1                      EQU       PWMDAT1   -Z_BASE
Z_PWMCFG                       EQU       PWMCFG    -Z_BASE
Z_PWMCH0                       EQU       PWMCH0    -Z_BASE
Z_PWMCH1                       EQU       PWMCH1    -Z_BASE
Z_PWMCH2                       EQU       PWMCH2    -Z_BASE
Z_PWMEN                        EQU       PWMEN     -Z_BASE
Z_PWMDAT2                      EQU       PWMDAT2   -Z_BASE

T_PWMCON                       EQU       PWMCON    -PWMBASE   
T_PWMSTA                       EQU       PWMSTA    -PWMBASE   
T_PWMDAT0                      EQU       PWMDAT0   -PWMBASE   
T_PWMDAT1                      EQU       PWMDAT1   -PWMBASE   
T_PWMCFG                       EQU       PWMCFG    -PWMBASE   
T_PWMCH0                       EQU       PWMCH0    -PWMBASE   
T_PWMCH1                       EQU       PWMCH1    -PWMBASE   
T_PWMCH2                       EQU       PWMCH2    -PWMBASE   
T_PWMEN                        EQU       PWMEN     -PWMBASE   
T_PWMDAT2                      EQU       PWMDAT2   -PWMBASE   

PWMCON_OFFSET                  EQU       0x0C00
PWMSTA_OFFSET                  EQU       0x0C04
PWMDAT0_OFFSET                 EQU       0x0C08
PWMDAT1_OFFSET                 EQU       0x0C0C
PWMCFG_OFFSET                  EQU       0x0C10
PWMCH0_OFFSET                  EQU       0x0C14
PWMCH1_OFFSET                  EQU       0x0C18
PWMCH2_OFFSET                  EQU       0x0C1C
PWMEN_OFFSET                   EQU       0x0C20
PWMDAT2_OFFSET                 EQU       0x0C24
